
//  我心忆旧  2020-03-31 

//---------------------------------------------------
//   VS 2019  中文代码
//---------------------------------------------------

#include <iostream>  
#include <array>   
#include <time.h>    
#include <cstdlib>
#include "中文.h"   

静态数组<int, 30> 数组A = {};

整数 主函数()
{
 
   clock_t 开始, 结束,随机种子;
   开始 = clock();
   打印<< "类型:"  << " 静态数组 " << "\r\n";

	循环 (auto& i : 数组A)
	{
                              随机种子 = clock();
	               srand(随机种子);
                              i=  rand();
		打印 << "i:" << " / "<< i <<"\r\n";	
	}

   打印<< "时间结束:" << 结束 - 开始 << " / " << "\r\n";
 
   暂停;
   暂停;

   返回   0;

}


//--------------------------------------------------------------
// 项目中已上线的中英混合脚本
//--------------------------------------------------------------

声明  日期集合=[]；
声明  ABC=[]；

循环 (w,s in aaa)
{

if(s[2]=="企业名称" && s[9].到浮点数()>99)

{

日期集合.添加(s[7].到文本());

}
}

ABC=日期集合.去除重复(@(a,b)a==b);

声明  新文本=“”;

FOR (w,s in ABC)
{
新文本=新文本+s.到文本()+“\r\n";
}

脚本取文本（新文本）；


//--------------------------------------------------------------